leetcode_759_employee_free_time.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 759. Employee Free Time</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 759. Employee Free Time</h1>
<ul class="org-ul">
<li><a href="blackbox_you_solved_a_similar_problem.html#ID-37AF9679-42D1-4A85-9927-2A590268AD87">Blackbox: You solved a similar problem</a> with intervals where you used a <a href="stack.html#ID-06D27BC1-DFDC-4063-B3A9-7074FD5E13B3">Stack</a> to compute the answer, and I solved a problem to create a sorted list from a list of sorted lists (<a href="leetcode_23_merge_k_sorted_lists.html#ID-02D2E665-4FC5-45C7-A1BF-E7CE82E67B05">Leetcode: 23. Merge k Sorted Lists</a>).</li>

<li><a href="pre_processing_the_input_can_make_easier_to_solve_the_original_problem.html#ID-42B21DBC-4951-4AF2-8C41-A646F5675365">Can we pre-process the input in a way to make easy to solve the problem?</a>  We can create a list of all intervals sorted by start time.  This will help us to process all of them as they come.</li>

<li><a href="how_can_we_extend_the_solution_for_i_to_i_1.html#ID-45B9F3C8-D007-4980-95EF-4361906245A8">How can we extend the solution for \(i\) to \(i+1\)?</a>  Be \(a\) an array with all intervals sorted by start time.  We know that if there is a time off, it will definitely start after \(a[0].end\).  If \(a[1].start > a[0].end\), then there is a time off from \((a[0].end, a[1].start)\).  If \(a[1].start \leq a[0].end\), then the time off might start at \(\max(a[0].end, a[1].end)\).  This property holds for all intervals.  Therefore, we can keep a variable with the last end time and use it to create a new interval if needed or update it.  Time complexity is \(O(n \log m)\) where \(m\) is the total number of intervals, because we use a <a href="priority_queue.html#ID-FCBEA48C-CFF6-43C4-B430-BCD00E245D22">Priority-Queue</a> to get the next interval sorted by start time.  Space complexity is \(O(m)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-style: italic;">"""</span>
<span style="font-style: italic;"># Definition for an Interval.</span>
<span style="font-style: italic;">class Interval:</span>
<span style="font-style: italic;">    def __init__(self, start: int = None, end: int = None):</span>
<span style="font-style: italic;">        self.start = start</span>
<span style="font-style: italic;">        self.end = end</span>
<span style="font-style: italic;">"""</span>


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">employeeFreeTime</span>(<span style="font-weight: bold;">self</span>, schedule: <span style="font-style: italic;">"[[Interval]]"</span>) -&gt; <span style="font-style: italic;">"[Interval]"</span>:
        <span style="font-weight: bold; font-style: italic;">last</span> = <span style="font-weight: bold; text-decoration: underline;">None</span>
        <span style="font-weight: bold; font-style: italic;">ans</span> = []
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> merge(*schedule, key=<span style="font-weight: bold;">lambda</span> i: (i.start, i.end)):
            <span style="font-weight: bold;">if</span> last <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
                last = i.end
            <span style="font-weight: bold;">elif</span> i.start &lt;= last:
                last = <span style="font-weight: bold;">max</span>(last, i.end)
            <span style="font-weight: bold;">else</span>:
                ans.append(Interval(last, i.start))
                last = i.end
        <span style="font-weight: bold;">return</span> ans
</pre>
</div>
</div>
</body>
</html>